Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/faq/faq_config.po
Languages: fr

source: :index:`Configuration <configuration; config file location>`
fr: :index:`Configuration <configuration; emplacement du fichier de configuration>`

source: **Where is the Picard configuration saved?**
fr: **Où est enregistrée la configuration Picard?**

source: Picard saves the configuration in the file ``Picard.ini``. Its location depends on the operating system:
fr: Picard enregistre la configuration dans le fichier ``Picard.ini``. Son emplacement dépend du système d'exploitation:

source: This usually will be ``C:\Users\YourUserName\AppData\Roaming\MusicBrainz``, where ``YourUserName`` should be replaced with your actual Windows user name.
fr: Ce sera généralement ``C:\Users\YourUserName\AppData\Roaming\MusicBrainz``, où ``YourUserName`` doit être remplacé par votre nom d'utilisateur Windows actuel.

source: **macOS, Linux and other Unix like systems:**
fr: **macOS, Linux et autres systèmes de type Unix:**

source: **I tagged a file in Picard, but iTunes is not seeing the tags!**
fr: **J'ai tagué un fichier en Picard, mais iTunes ne voit pas les tags!**

source: First, you need to force :index:`iTunes <itunes>` to re-read the information from your tags and update its library. This is discussed in the `iTunes Guide <https://musicbrainz.org/doc/iTunes_Guide>`_.
fr: Tout d'abord, vous devez forcer :index:`iTunes <itunes>` à relire les informations de vos balises et à mettre à jour sa bibliothèque. Ceci est discuté dans le `iTunes Guide <https://musicbrainz.org/doc/iTunes_Guide>`_.

source: Additionally, iTunes has a known bug in its ID3v2.4 implementation, which makes it unable to read such tags if they also contain embedded cover art. As a work-around, you can configure Picard to write ID3v2.3 tags.
fr: De plus, iTunes a un bogue connu dans son implémentation ID3v2.4, qui le rend incapable de lire ces balises si elles contiennent également uart de couverture intégrée. Pour contourner le problème, vous pouvez configurer Picard pour écrire des balises ID3v2.3.

source: **My tags are truncated to 30 characters in Windows Media Player!**
fr: **Mes balises sont tronquées à 30 caractères dans Windows Media Player!**

source: Prior to version 0.14, Picard's default settings were to write ID3v2.4 and ID3v1 tags to files. WMP can't read ID3v2.4, so it falls back to ID3v1 which has a limitation of 30 characters per title. To solve this on versions prior to 0.14, configure Picard to write ID3v2.3 tags instead.
fr: Avant la version 0.14, les paramètres par défaut de Picard étaient d'écrire les balises ID3v2.4 et ID3v1 dans les fichiers. WMP ne peut pas lire ID3v2.4, il revient donc à ID3v1 qui a une limitation de 30 caractères par titre. Pour résoudre ce problème sur les versions antérieures à 0.14, configurez Picard pour qu'il écrive des balises ID3v2.3 à la place.

source: Starting with version 0.14, the default settings have been changed to ID3v2.3 and this should no longer be an issue.
fr: À partir de la version 0.14, les paramètres par défaut ont été modifiés en ID3v2.3 et cela ne devrait plus être un problème.

source: **How do I tell Picard which browser to use?**
fr: **Comment indiquer à Picard quel navigateur utiliser?**

source: On Windows, macOS, GNOME and KDE, Picard uses the :index:`default browser <pair: configuration; browser>` that has been configured for the system. On other systems, you can use the ``BROWSER`` environment variable.
fr: Sous Windows, macOS, GNOME et KDE, Picard utilise le :index:`navigateur par défaut <pair: configuration; navigateur>` qui a été configuré pour le système. Sur d'autres systèmes, vous pouvez utiliser la variable d'environnement ``BROWSER``.

source: For example::
fr: Par exemple::

source: Another approach that works in some GNU/Linux systems is the following command::
fr: Une autre approche qui fonctionne dans certains systèmes GNU / Linux est la commande suivante::

source: This should present you with a list of existing browsers in your system, allowing you to select the one to use by default.
fr: Cela devrait vous présenter une liste des navigateurs existants dans votre système, vous permettant de sélectionner celui à utiliser par défaut.
