Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/faq/faq_usage.po
Languages: fr

source: Using Picard
fr: Utiliser Picard

source: **How do I tag files with Picard?**
fr: **Comment marquer des fichiers avec Picard?**

source: There is a separate section that explains the tagging process. Please see :doc:`../usage/using` for details.
fr: Une section distincte explique le processus de marquage. Veuillez consulter :doc:`../usage/using` pour plus de détails.

source: **The green "Tagger" icon disappeared from MusicBrainz.org, how do I get it back?**
fr: **L'icône verte "Tagger" a disparu de MusicBrainz.org, comment puis-je la récupérer?**

source: This :index:`icon <tagger icon, icon; tagger>` shows up when a manual lookup is performed via Picard using :menuselection:`"Tools --> Lookup"`.
fr: Cette :index:`icône <icône de tagueur>` apparaît lorsqu'une recherche manuelle est effectuée via Picard en utilisant :menuselection:`"Outils --> Recherche"`.

source: Alternatively the parameter ``?tport=8000`` can be added to the end of almost any MusicBrainz URL and the green tagger icons will continue to show up from then on.
fr: Alternativement, le paramètre ``?tport=8000`` peut être ajouté à la fin de presque toutes les URL MusicBrainz et les icônes de tagger vertes continueront à apparaître à partir de là.

source: **I'm trying to load a release in Picard, but all I'm seeing is "Couldn't load album errors". What's up?**
fr: **J'essaye de charger une sortie en Picard, mais tout ce que je vois est "Impossible de charger les erreurs d'album". Quoi de neuf?**

source: If you get "Couldn't load album errors" for releases in Picard, this can occur for a number of reasons. Check the following:
fr: Si vous obtenez "Impossible de charger les erreurs d'album" pour les versions en Picard, cela peut se produire pour plusieurs raisons. Vérifiez les éléments suivants:

source: **1. Is the problem persistent for a given release?**
fr: **1. Le problème persiste-t-il pour une version donnée?**

source: Try waiting a minute or two, or even a bit longer and then try again with a right-click, "Refresh". Sometimes the servers are just overloaded and temporarily reject requests.
fr: Essayez d'attendre une minute ou deux, voire un peu plus longtemps, puis réessayez avec un clic droit, "Actualiser". Parfois, les serveurs sont simplement surchargés et rejettent temporairement les demandes.

source: **2. Has the release been deleted from MusicBrainz?**
fr: **2. La version a-t-elle été supprimée de MusicBrainz?**

source: If you are re-tagging files previously tagged with Picard, and get this error, the release has possibly been deleted. Try to right-click and use the "Lookup in browser" option to view the release on the website. If you can't find it, it may have been deleted. This could be because you tagged a pending release that was voted down, or tagged against a release that was deleted because editors decided it wasn't a valid release. This can happen for homebrew compilations, bad torrent or pirate rips, "advance" releases or very poorly added releases. Usually there will be an alternate release you can tag against, which you can find by searching or doing another clustered lookup from Picard. If you can't find a replacement and believe it has been deleted unfairly, `submit a new release <https://musicbrainz.org/doc/How_to_Add_a_Release>`_, supplying evidence of the tracklisting and as much information as possible to prove it is genuine and it may be accepted again.
fr: Si vous re-taggez des fichiers précédemment balisés avec Picard et que vous obtenez cette erreur, la version a peut-être été supprimée. Essayez de cliquer avec le bouton droit de la souris et d'utiliser l'option "Rechercher dans le navigateur" pour afficher la version sur le site Web. Si vous ne le trouvez pas, il se peut qu'il ait été supprimé. Cela peut être dû au fait que vous avez balisé une version en attente qui a été rejetée ou que vous avez balisé une version qui a été supprimée parce que les éditeurs ont décidé qu'il ne s'agissait pas d'une version valide. Cela peut arriver pour les compilations homebrew, les mauvais rips torrent ou pirate, les versions "avancées" ou les versions très mal ajoutées. Habituellement, il y aura une version alternative sur laquelle vous pouvez étiqueter, que vous pouvez trouver en recherchant ou en effectuant une autre recherche groupée de Picard. Si vous ne trouvez pas de remplaçant et pensez qu'il a été supprimé injustement, `soumettez une nouvelle version <https://musicbrainz.org/doc/How_to_Add_a_Release>`_, en fournissant des preuves de la tracklist et autant d'informations que possible pour prouver il est authentique et il peut être accepté à nouveau.

source: **I'm using macOS, where are my network folders or drives?**
fr: **J'utilise macOS, où sont mes dossiers ou lecteurs réseau?**

source: These should show up in the add file and add folder dialogs, but they aren't visible by default in the file browser pane. If you want to see them in the file browser pane, right click in the pane and select "show hidden files". They should then be visible in the /Volumes folder.
fr: Ceux-ci devraient apparaître dans les boîtes de dialogue d'ajout de fichier et d'ajout de dossier, mais ils ne sont pas visibles par défaut dans le volet du navigateur de fichiers. Si vous souhaitez les voir dans le volet du navigateur de fichiers, faites un clic droit dans le volet et sélectionnez "afficher les fichiers cachés". Ils doivent alors être visibles dans le dossier /Volumes.

source: **macOS shows the app is damaged. How can I run Picard?**
fr: **macOS indique que l'application est endommagée. Comment puis-je diriger Picard?**

source: On "index:`macOS <macos>` 10.12 and 10.13 there have been reports that sometimes the MusicBrainz Picard app cannot be started and macOS shows an error message:
fr: Sur :index:`macOS <macos>` 10.12 et 10.13, il y a eu des rapports indiquant que parfois l'application MusicBrainz Picard ne peut pas être démarrée et macOS affiche un message d'erreur:

source: "MusicBrainz Picard.app" is damaged and can't be opened. You should move it to the Trash.
fr: "MusicBrainz Picard.app" est endommagé et ne peut pas être ouvert. Vous devez le déplacer vers la corbeille.

source: This mostly seems to happen after moving the file to the Applications folder and seems to be caused by Gatekeeper mistakenly marking the app as damaged. To solve the issue open a terminal and run::
fr: Cela semble se produire principalement après le déplacement du fichier dans le dossier Applications et semble être causé par Gatekeeper marquant par erreur l'application comme endommagée. Pour résoudre le problème, ouvrez un terminal et exécutez::

source: This will clear the app being marked as damaged. If you have placed the app in a different location than :file:`/Applications` adjust the path in the command above accordingly.
fr: Cela effacera l'application marquée comme endommagée. Si vous avez placé l'application dans un emplacement différent de :file:`/Applications` ajustez le chemin dans la commande ci-dessus en conséquence.
