Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/config/options_tags_compatibility_wave.po
Languages: fr

source: WAVE Files
fr: Fichiers WAVE

source: WAVE by itself as a standard only supports the INFO chunk tags, which are very limited. In addition, INFO chunks don't have any proper support for encoding.
fr: WAVE par lui-même en tant que norme ne prend en charge que les balises de bloc INFO, qui sont très limitées. De plus, les blocs INFO n'ont pas de support approprié pour l'encodage.

source: In all cases Picard will write ID3 tags to the WAVE files. This is supported by quite a few tools; however, it is not supported universally. Tools not supporting ID3 tags should just ignore them. If possible, this is likely the best option to have proper tags in WAVE files. For compatibility with software that does not support ID3v2 tags, Picard can also save `Resource Interchange File Format <https://wikipedia.org/wiki/Resource_Interchange_File_Format>`_ (RIFF) INFO tags to WAVE files. RIFF INFO is read and written only as an extra. If there are no existing ID3 tags, the data from RIFF INFO will be used. When saving files, RIFF INFO will be written in addition to the ID3v2 tags.
fr: Dans tous les cas, Picard écrira des balises ID3 dans les fichiers WAVE. Ceci est soutenu par un certain nombre d'outils; cependant, il n'est pas pris en charge universellement. Les outils ne prenant pas en charge les balises ID3 doivent simplement les ignorer. Si possible, c'est probablement la meilleure option pour avoir des balises appropriées dans les fichiers WAVE. Pour la compatibilité avec les logiciels qui ne prennent pas en charge les balises ID3v2, Picard peut également enregistrer les balises `Resource Interchange File Format <https://wikipedia.org/wiki/Resource_Interchange_File_Format>`_ (RIFF) INFO tags dans des fichiers WAVE. RIFF INFO n'est lu et écrit qu'en supplément. S'il n'y a pas de balises ID3 existantes, les données de RIFF INFO seront utilisées. Lors de l'enregistrement des fichiers, RIFF INFO sera écrit en plus des balises ID3v2.

source: Picard's use of the RIFF INFO tags is determined by the following configuration settings:
fr: L'utilisation par Picard des balises RIFF INFO est déterminée par les paramètres de configuration suivants:

source: **Also include RIFF INFO tags in the files**
fr: ** Incluez également les balises RIFF INFO dans les fichiers **

source: Picard will save the RIFF INFO tags to the files.
fr: Picard enregistrera les balises RIFF INFO dans les fichiers.

source: **Remove existing RIFF INFO tags from WAVE files**
fr: ** Supprimer les balises RIFF INFO existantes des fichiers WAVE **

source: Picard will remove any existing RIFF INFO tags from the WAVE files. This setting is ignored if the previous setting is enabled to allow writing the RIFF INFO tags to the files.
fr: Picard supprimera toutes les balises RIFF INFO existantes des fichiers WAVE. Ce paramètre est ignoré si le paramètre précédent est activé pour permettre l'écriture des balises RIFF INFO dans les fichiers.

source: **RIFF INFO Text Encoding**
fr: **Encodage de texte RIFF INFO**

source: This setting allows you to specify the encoding used for the RIFF INFO tags written. The default setting is Windows-1252 encoding. Picard can also use UTF-8 as an alternative, which allows for full language support, but it depends on the software reading it. Typically, if the software supports this, it will read the ID3 tags anyway so there is not much to be gained.
fr: Ce paramètre vous permet de spécifier l'encodage utilisé pour les balises RIFF INFO écrites. Le paramètre par défaut est le codage Windows-1252. Picard peut également utiliser UTF-8 comme alternative, ce qui permet une prise en charge complète du langage, mais cela dépend du logiciel qui le lit. En règle générale, si le logiciel prend en charge cela, il lira de toute façon les balises ID3, il n'y a donc pas grand chose à gagner.
