Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/config/options_network.po
Languages: fr

source: :index:`Network <configuration; network>`
fr: :index:`Réseau <configuration; réseau>`

source: **Web Proxy**
fr: **Proxy Web**

source: If you need a proxy to make an outside network connection you may specify one here. You can choose between HTTP and SOCKS proxy. The required settings are **Server Address** and **Port**. If the proxy requires authentication also enter **Username** and **Password**.
fr: Si vous avez besoin d'un proxy pour établir une connexion réseau externe, vous pouvez en spécifier un ici. Vous pouvez choisir entre le proxy HTTP et SOCKS. Les paramètres requis sont **Adresse du serveur** et **Port**. Si le proxy requiert une authentification, saisissez également **Nom d'utilisateur** et **Mot de passe**.

source: **Request timeout in seconds**
fr: **Demander un délai d'expiration en secondes**

source: By default Picard will abort running network requests after 30 seconds of inactivity. If needed you can change the timeout period here.
fr: Par défaut, Picard abandonnera les requêtes réseau en cours après 30 secondes d'inactivité. Si nécessaire, vous pouvez modifier le délai d'expiration ici.

source: **Browser Integration**
fr: **Intégration du navigateur**

source: The browser integration allows you to load releases and recordings into Picard directly from the MusicBrainz website. Once you have opened musicbrainz.org in your browser from Picard, the website will show the green tagger button |lookup_tagger| next to releases and recordings. Clicking on this button will load the corresponding release or recording into Picard.
fr: L'intégration du navigateur vous permet de charger des versions et des enregistrements dans Picard directement à partir du site Web MusicBrainz. Une fois que vous avez ouvert musicbrainz.org dans votre navigateur depuis Picard, le site Web affichera le bouton tagger vert |lookup_tagger| à côté des sorties et des enregistrements. Cliquer sur ce bouton chargera la version ou l'enregistrement correspondant dans Picard.

source: **Default listening port**
fr: **Port d'écoute par défaut**

source: This identifies the default port Picard will listen on for the browser integration. If the port is not available Picard will try to increase the port number by one until it finds a free port.
fr: Cela identifie le port par défaut que Picard écoutera pour l'intégration du navigateur. Si le port n'est pas disponible, Picard essaiera d'augmenter le numéro de port de un jusqu'à ce qu'il trouve un port libre.

source: **Listen only on localhost**
fr: **Écoutez uniquement sur localhost**

source: By default Picard will limit access to the browser integration port to your local machine. Deactivating this option will expose the port on your network, allowing you to request Picard to load a specific release or recording via the network. For example, this would be used for the `Picard Barcode Scanner <https://play.google.com/store/apps/details?id=org.musicbrainz.picard.barcodescanner>`_ Android app.
fr: Par défaut, Picard limitera l'accès au port d'intégration du navigateur à votre machine locale. La désactivation de cette option exposera le port sur votre réseau, vous permettant de demander à Picard de charger une version ou un enregistrement spécifique via le réseau. Par exemple, cela serait utilisé pour l'application `Picard Barcode Scanner <https://play.google.com/store/apps/details?id=org.musicbrainz.picard.barcodescanner>`_ pour Android.

source: Only expose the port externally when you actually need it and only on networks you trust. Exposing application ports via the network can open potential security holes on your system.
fr: N'exposez le port en externe que lorsque vous en avez réellement besoin et uniquement sur les réseaux de confiance. L'exposition des ports d'application via le réseau peut ouvrir des failles de sécurité potentielles sur votre système.
