Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/index.po
Languages: fr

source: About Picard
fr: À propos de Picard

source: Getting Started
fr: Commencer

source: General Usage
fr: Usage général

source: Using Picard
fr: Utiliser Picard

source: General Recommendations
fr: Recommandations générales

source: Workflow Recommendations
fr: Recommandations générales

source: Troubleshooting
fr: Dépannage

source: Appendices
fr: Annexes

source: **User Guide for MusicBrainz Picard, the next generation tagger.**
fr: **Guide de l'utilisateur pour MusicBrainz Picard, le taggeur de nouvelle génération.**

source: MusicBrainz Picard is a cross-platform music file tagger. This User Guide is intended to augment the information provided on the `Picard website <https://picard.musicbrainz.org/>`_ and to provide an alternate format for the documentation, including a PDF document suitable for printing. Links to additional information such as scripts, plugins and tutorials are provided when available rather than trying to reproduce the information in this document.
fr: MusicBrainz Picard est un tagueur de fichiers musicaux multiplateforme. Ce guide de l'utilisateur est destiné à compléter les informations fournies sur le `site Picard <https://picard.musicbrainz.org/>`_ et à fournir un autre format pour la documentation, y compris un document PDF adapté à impression. Des liens vers des informations supplémentaires telles que des scripts, des plugins et des didacticiels sont fournis lorsqu'ils sont disponibles plutôt que d'essayer de reproduire les informations contenues dans ce document.

source: This documentation is licensed under CC0 1.0. To view a copy of this license, visit `https://creativecommons.org/publicdomain/zero/1.0 <https://creativecommons.org/publicdomain/zero/1.0>`_.
fr: Cette documentation est sous licence CC0 1.0. Pour afficher une copie de cette licence, visitez `https://creativecommons.org/publicdomain/zero/1.0 <https://creativecommons.org/publicdomain/zero/1.0>`_.
