Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/appendices/command_line.po
Languages: fr

source: Appendix C: :index:`Command Line Options <pair: command line; options>`
fr: Annexe C: :index:`Options de ligne de commande <pair: ligne de commande; options>`

source: Picard can be started from the command line with the following arguments:
fr: Picard peut être démarré à partir de la ligne de commande avec les arguments suivants:

source: where the options are:
fr: où les options sont:

source: ``-h``, ``--help`` show a help message and exit
fr: ``-h``, ``--help`` affiche un message d'aide et quitte

source: ``-c CONFIG_FILE``, ``--config-file CONFIG_FILE`` location of the configuration file to use
fr: ``-c CONFIG_FILE``, ``--config-file CONFIG_FILE`` emplacement du fichier de configuration à utiliser

source: ``-d``, ``--debug`` enable debug-level logging
fr: ``-d``, ``--debug`` active la journalisation au niveau du débogage

source: ``-M``, ``--no-player`` disable built-in media player
fr: ``-M``, ``--no-player`` désactiver le lecteur multimédia intégré

source: ``-N``, ``--no-restore`` do not restore window positions or sizes
fr: ``-N``, ``--no-restore`` ne restaure pas la position ou la taille des fenêtres

source: ``-P``, ``--no-plugins`` do not load any plugins
fr: ``-P``, ``--no-plugins`` ne chargent aucun plug-in

source: ``-v``, ``--version`` display the version information and exit
fr: ``-v``, ``--version`` affiche les informations de version et quitte

source: ``-V``, ``--long-version`` display the long version information and exit
fr: ``-V``, ``--long-version`` affiche les informations de la version longue et quitte

source: ``FILE`` is the file or files to load
fr: ``FILE`` est le ou les fichiers à charger
