Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/variables/tags_advanced.po
Languages: fr

source: :index:`Advanced Tags <tags; advanced>`
fr: :index:`Balises avancées <balises; avancées>`

source: You can make additional tags available by enabling the :ref:`Advanced Relationships <advanced_relationships>` and the :ref:`Use genres from MusicBrainz <genre_settings>` settings in Picard.
fr: Vous pouvez rendre des balises supplémentaires disponibles en activant les paramètres :ref:`Relations avancées <advanced_relationships>` et :ref:`Utiliser les genres de MusicBrainz <genre_settings>` paramètres dans Picard.

source: Tags will not be created and will not be available as variables if there was no value retrieved for the tag from the MusicBrainz database.
fr: Les balises ne seront pas créées et ne seront pas disponibles en tant que variables si aucune valeur n'a été récupérée pour la balise dans la base de données MusicBrainz.

source: Some of these tags are only supported for certain file types or tag formats. Please see the :doc:`Picard Tag Mapping <../appendices/tag_mapping>` section for details.
fr: Certaines de ces balises ne sont prises en charge que pour certains types de fichiers ou formats de balises. Veuillez consulter la section :doc:`Picard Tag Mapping <../appendices/tag_mapping>` pour plus de détails.

source: Advanced Relationship Tags
fr: Balises de relation avancées

source: If you enable tagging with Advanced Relationships, you get these extra tags:
fr: Si vous activez le balisage avec les relations avancées, vous obtenez ces balises supplémentaires:

source: Arranger Relationship Type (releases, recordings, works), Instrumentator Relationship Type, Orchestrator Relationship Type (*since Picard 0.10*)
fr: Type de relation arrangeur (sorties, enregistrements, œuvres), type de relation instrumentateur, type de relation orchestrateur (*depuis Picard 0.10*)

source: Composer Relationship Type
fr: Type de relation de compositeur

source: Composer Relationship Type's Sort Name
fr: Nom de tri du type de relation de compositeur

source: Conductor Relationship Type (releases, recordings), Chorus Master Relationship Type (releases, recordings)
fr: Type de relation de chef d'orchestre (sorties, enregistrements), type de relation de maître de chœur (sorties, enregistrements)

source: Mix-DJ Relationship Type (*since Picard 0.9*)
fr: Type de relation Mix-DJ (*depuis Picard 0.9*)

source: Engineer Relationship Type
fr: Type de relation ingénieur

source: License Relationship Type (releases, recordings) (*since Picard 1.0*)
fr: Type de relation de licence (sorties, enregistrements) (*depuis Picard 1.0*)

source: Lyricist Relationship Type
fr: Type de relation parolier

source: Engineer Relationship Type ("Mixed By") (*since Picard 0.9*)
fr: Type de relation ingénieur ("Mixé par") (*depuis Picard 0.9*)

source: Performer Relationship Type (releases - vocals/instruments, recordings - vocals/instruments), <type> can be "vocal", "guest guitar", "solo violin", …
fr: Type de relation interprète (sorties - voix / instruments, enregistrements - voix / instruments), <type> peut être "vocal", "guest guitar", "solo violin",…

source: Orchestra Relationship Type (releases, recordings), <type> is "orchestra"
fr: Type de relation avec l'orchestre (sorties, enregistrements), <type> est "orchestra"

source: Concertmaster Relationship Type (releases, recordings), <type> is "concertmaster"
fr: Type de relation Maître de concert (sorties, enregistrements), <type> est "concertmaster"

source: Producer Relationship Type
fr: Type de relation producteur

source: Remixer Relationship Type
fr: Type de relation de remixeur

source: Work Name (*since Picard 1.3*)
fr: Nom du travail (*depuis Picard 1.3*)

source: Writer Relationship Type (*since Picard 1.0*). Not written to most file formats automatically. You can merge this with composers with a script like::
fr: Type de relation écrivain (*depuis Picard 1.0*). Non écrit automatiquement dans la plupart des formats de fichiers. Vous pouvez fusionner cela avec des compositeurs avec un script comme::

source: :index:`Genre Tags <tags; genre>`
fr: :index:`Balises de genre <balises; de genre>`

source: If you enable Use genres from MusicBrainz, you get:
fr: Si vous activez Utiliser les genres de MusicBrainz, vous obtenez:

source: Genre information from MusicBrainz (*since Picard 2.1, earlier versions used folksonomy tags*)
fr: Informations sur le genre de MusicBrainz (*depuis Picard 2.1, les versions antérieures utilisaient des balises folksonomy*)
