Repository: rdswift/picard-docs-rtd-test
Catalog: _locale/*/LC_MESSAGES/troubleshooting/missing_tags.po
Languages: fr

source: Tags are not updated or saved
fr: Les balises ne sont ni mises à jour ni enregistrées

source: There are typically four reasons that tags may not be written or updated when files are saved:
fr: Il existe généralement quatre raisons pour lesquelles les balises peuvent ne pas être écrites ou mises à jour lorsque les fichiers sont enregistrés:

source: **Saving tags has not been enabled in the configuration settings**
fr: **L'enregistrement des balises n'a pas été activé dans les paramètres de configuration**

source: Confirm that the :menuselection:`"Options --> Save tags"` setting has been enabled. See :ref:`action_options` for more information.
fr: Vérifiez que le paramètre :menuelection:`"Options --> Enregistrer les variables"` a été activé. Voir :ref`action_options` pour plus d'informations.

source: **Tags are being set in the file naming script**
fr: **Les balises sont définies dans le script de dénomination de fichier**

source: Tags created or updated in the file naming script will not be written to the output files. This script is only used for developing the file name and directory structure for the output. If you want to set or update a tag value in a script, it must be in a tagging script. Please see the :doc:`../extending/scripts` section for more information about the different types of scripts.
fr: Les balises créées ou mises à jour dans le script de dénomination de fichier ne seront pas écrites dans les fichiers de sortie. Ce script est uniquement utilisé pour développer le nom de fichier et la structure de répertoires pour la sortie. Si vous souhaitez définir ou mettre à jour une valeur de balise dans un script, elle doit se trouver dans un script de balisage. Veuillez consulter la section :doc:`../extending/scripts` pour plus d'informations sur les différents types de scripts.

source: **The tags begin with an underscore**
fr: **Les balises commencent par un trait de soulignement**

source: Tags whose names begin with an underscore, regardless of how they are created, will not be written to the output files. These are considered variables for use within Picard rather than tags. Please see the :doc:`../variables/variables` section for more information regarding the difference between tags and variables.
fr: Les balises dont les noms commencent par un trait de soulignement, quelle que soit la façon dont elles sont créées, ne seront pas écrites dans les fichiers de sortie. Celles-ci sont considérées comme des variables à utiliser dans Picard plutôt que des balises. Veuillez consulter la section :doc:`../variables/variables` pour plus d'informations concernant la différence entre les balises et les variables.

source: **The file type does not support writing tags**
fr: **Le type de fichier ne prend pas en charge l'écriture de balises**

source: Confirm that the file type that you are writing actually supports the tags that are to be written. Not all file types support all the tags Picard supports. Please see the :doc:`../appendices/tag_mapping` section for details about the tags supported by various file formats.
fr: Vérifiez que le type de fichier que vous écrivez prend en charge les balises à écrire. Tous les types de fichiers ne prennent pas en charge toutes les balises prises en charge par Picard. Veuillez consulter la section :doc:`../appendices/tag_mapping` pour plus de détails sur les balises prises en charge par différents formats de fichiers.
